# sudo apt install git - установка системы контроля версий.

# git - система контроля версий, 
# программа для управления версиями кода 

# github - сервис для хранения кода.

# репозиторий - папка с которой пожет взаимодействовать git 
# git init - команда, которая превращает текущюю папку в git репозиторий.

# git status- проверка статуса репозитория
# git add <file_name> / git add . - добавить файлы к отслеживанию 
# изменений

# git commit -m "комментарий к версии" -
# сохранение версии кода / создание комита (попраки или комментария)


git remote add <название-переменной> 
(принято называть "origin") <ссылка_на_удаленный_репозиторий>-
соединение локального репозитория с удаленным.


git push <название_переменной> <название_ветки> - отправка версии на github 

add git branch bloddo 
git checkout bloddo
